In [1]:
import pandas as pd

In [3]:
dict1 = {'Name' :['Anu','Aman','Raja','Jyothi','Shreyansh','Susmita','Prathyusha'],
            'Marks':[90,78,84,69,85,88,95],
            'Gender' :['Female','Male','Male','Female','Male','Female','Female']
        }
df = pd.DataFrame(dict1)
df

         Name  Marks  Gender
0         Anu     90  Female
1        Aman     78    Male
2        Raja     84    Male
3      Jyothi     69  Female
4   Shreyansh     85    Male
5     Susmita     88  Female
6  Prathyusha     95  Female

In [4]:
#display top 3 rows of the dataset

df.head(3)

   Name  Marks  Gender
0   Anu     90  Female
1  Aman     78    Male
2  Raja     84    Male

In [5]:
#display last 3 rows
df.tail(3)

         Name  Marks  Gender
4   Shreyansh     85    Male
5     Susmita     88  Female
6  Prathyusha     95  Female

In [9]:
#Find shape of dataset (no of rows and columns)

df.shape
print('no of rows', df.shape[0])
print('no of columns', df.shape[1])

no of rows 7
no of columns 3

In [8]:
#get information about dataset like total no of rows, column, datatype of each column and memory requirement

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [20]:
#check null values
df.isnull()
df.isnull().sum()
df.isnull().sum(axis=0)
df.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [21]:
#get overall statistics about the dataframe
df.describe(include = 'all')

       Name      Marks  Gender
count     7   7.000000       7
unique    7        NaN       2
top     Anu        NaN  Female
freq      1        NaN       4
mean    NaN  84.142857     NaN
std     NaN   8.513295     NaN
min     NaN  69.000000     NaN
25%     NaN  81.000000     NaN
50%     NaN  85.000000     NaN
75%     NaN  89.000000     NaN
max     NaN  95.000000     NaN

In [17]:
#find unique values from the gender column

df['Gender'].unique()

array(['Female', 'Male'], dtype=object)

In [30]:
#find the number of unique values from the gender column

df['Gender'].nunique()

2

In [32]:
#find the count of unique values from the gender column

df['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [39]:
# find total number of students having marks between 90 to 100. (iclusive), without using between method


len(df[(df['Marks']>=90) &  (df['Marks']<= 100)])

2

In [41]:

# find total number of students having marks between 90 to 100. (iclusive) with using between method
sum(df['Marks'].between(90,100))

2

In [42]:
#find avg marks

avgerage_marks = sum(df['Marks'])/len((df['Marks']))
avgerage_marks

84.14285714285714

In [43]:
#find avg marks using mean()

avgerage_marks = df['Marks'].mean()  #we can use max, min like this
avgerage_marks

84.14285714285714

In [47]:
#Apply method  to get custom calculation, here diving marks by 2 and then calling custom method by using apply metjod

def marks(x):
    return x//2  #// ignore float point, normal division (/) will give float point


df['Half_marks'] = df['Marks'].apply(marks)
df

         Name  Marks  Gender  Half_marks
0         Anu     90  Female          45
1        Aman     78    Male          39
2        Raja     84    Male          42
3      Jyothi     69  Female          34
4   Shreyansh     85    Male          42
5     Susmita     88  Female          44
6  Prathyusha     95  Female          47

In [48]:
# lambda function using apply method for  diving marks by 2 (not using user define function)

df['Marks'].apply(lambda x:x/2)

0    45.0
1    39.0
2    42.0
3    34.5
4    42.5
5    44.0
6    47.5
Name: Marks, dtype: float64

In [49]:
#getting length of name using apply function

df['Name'].apply(len)

0     3
1     4
2     4
3     6
4     9
5     7
6    10
Name: Name, dtype: int64

In [55]:
# Map function:  We want perform 1 where "Male" and 0 for "Female" in gender column using Map function


df['Male_Female'] = df['Gender'].map({'Male' :1,'Female':0})
df

         Name  Marks  Gender  Half_marks  Male_Female
0         Anu     90  Female          45            0
1        Aman     78    Male          39            1
2        Raja     84    Male          42            1
3      Jyothi     69  Female          34            0
4   Shreyansh     85    Male          42            1
5     Susmita     88  Female          44            0
6  Prathyusha     95  Female          47            0

In [57]:
# Drop the multiple columns using list. if we drop only single column then no need to use list

df.drop(['Half_marks','Male_Female'], axis = 1, inplace = True) #used inplace = true to midify existimg dataset

In [58]:
df

         Name  Marks  Gender
0         Anu     90  Female
1        Aman     78    Male
2        Raja     84    Male
3      Jyothi     69  Female
4   Shreyansh     85    Male
5     Susmita     88  Female
6  Prathyusha     95  Female

In [59]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [60]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [63]:
#sort the dataset based on particular column

df.sort_values(by = 'Marks')  #in ascending order

df.sort_values(by = 'Marks', ascending = False)  # in decending order

         Name  Marks  Gender
6  Prathyusha     95  Female
0         Anu     90  Female
5     Susmita     88  Female
4   Shreyansh     85    Male
2        Raja     84    Male
1        Aman     78    Male
3      Jyothi     69  Female

In [65]:
# Display name and marks for the female students
#for name and marks we are using 2-d list, if we show gender also with name, marks we will use 2-d list 

df[df['Gender'] == 'Female'][['Name','Marks','Gender']]

         Name  Marks  Gender
0         Anu     90  Female
3      Jyothi     69  Female
5     Susmita     88  Female
6  Prathyusha     95  Female

In [67]:
# Display name and marks for the female students
#for name and marks we are using 2-d list, if we show gender also with name, marks we will use 2-d list 
#using pandas

df[df['Gender'].isin(['Female'])][['Name','Marks']]

         Name  Marks
0         Anu     90
3      Jyothi     69
5     Susmita     88
6  Prathyusha     95